Repository: giellalt/corpus-smn
Catalog: prestable/tmx/smn2eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=302_lang=anaras.html.tmx
Source language: smn
Languages: eng

source: Ohtâvuotâ
eng: Contact information

source: Sajos
eng: Sámi Cultural Centre Sajos

source: Av-teknikko Janne Lappalainen
eng: Mr. Janne Lappalainen This e-mail address is being protected from spam bots, you need JavaScript enabled to view it

source: Laitoshuoltaja Pirkko Pieski
eng: Security / Maintenance / Information

source: Toimistosihteeri Ritva Tammela
eng: Information Desk Office
